ЦентраАдминистрированияСервер/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>Архивная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыВКластере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.Кластеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКБазе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗапуска</name>
    <type>
      <types>EnumRef.РежимЗапускаПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверБазДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСервернаяИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/InformationRegisters/СостояниеИнформационныхБаз/СостояниеИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеИнформационныхБаз</name>
  <resources>
    <name>SQLБазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SQLСерверБазДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокировкаНачалаСеансов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрыБлокировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРезервнойКопии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонфигурацияИзменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекущийРелиз</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МониторингОшибокСинхронизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЦентраАдминистрированияСервер/src/Enums/РежимЗапускаПриложения/РежимЗапускаПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимЗапускаПриложения</name>
  <enumValues>
    <name>УправляемоеПриложение</name>
  </enumValues>
  <enumValues>
    <name>ОбычноеПриложение</name>
  </enumValues>
</mdclass:Enum>

ЦентраАдминистрированияСервер/src/Catalogs/ИнформационныеБазы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.РежимЗапуска = Перечисления.РежимЗапускаПриложения.УправляемоеПриложение;
	Иначе
		СостояниеИнформационнойБазы = РегистрыСведений.СостояниеИнформационныхБаз.СоздатьНаборЗаписей();
		СостояниеИнформационнойБазы.Отбор.ИнформационнаяБаза.Установить(Параметры.Ключ);
		СостояниеИнформационнойБазы.Прочитать();
		Для каждого СтрокаСостояние из СостояниеИнформационнойБазы цикл
			SQLБазаДанных = СтрокаСостояние.SQLБазаДанных;
			SQLСерверБазДанных = СтрокаСостояние.SQLСерверБазДанных;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
